{
  "main": {
    "name":"Pranava S Balugari",
    "occupation":"Senior Software Engineer",
    "description":" currently employed by ",
    "employer":"Innowell Pty Ltd.",
    "jobDescription":"full stack software engineer working in mental health space.",
    "image":"pranava_swaroop.jpg",
    "bio":"I am an athlete at heart, with an entrepreneurial spirit, and a passion for coding. I pursued my first development job 5+ years ago with Fairfax. I was hired as a full stack developer by Fairfax and now by Innowell, where I work today. Since beginning my career I have been tinkering with multiple languages and have affinity towards DevOps space. I am currently working towards completing AWS certifications and gaining knowledge in GoLang while working as a full stack developer.",
    "contactmessage":"Have a project for me? Think I'd be a good fit for your team? I'd love to hear from you, give me a shout by email or by using the form below if you'd like to get in contact with me.",
    "email": "stalin.pranava@gmail.com",
    "phone": "0426806239",
    "address":{
      "street":"11 Pembroke Street",
      "city":"Epping",
      "state":"NSW",
      "zip": "2121"
    },
    "website": "https://www.elitenomad.me",
    "resumedownload":"https://drive.google.com/open?id=1Gs9uq44JeVYFQ4k1h7M17r9mY5-VW4q5",
    "social":[
      {
        "name":"facebook",
        "url": "https://www.facebook.com/elitenomad.4059",
        "className":"fa fa-facebook"
      },
      {
        "name":"linkedin",
        "url": "https://www.linkedin.com/in/pranava-swaroop-ab7b5879",
        "className":"fa fa-linkedin"
      },
      {
        "name":"stack-overflow",
        "url": "https://stackoverflow.com/users/3163686/pranava-s-balugari",
        "className":"fa fa-stack-overflow"
      },
      {
        "name":"github",
        "url":"http://github.com/elitenomad",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"I'm a tinkerer and am always interested in playing around with new technologies but these are the ones that have really won me over",
    "education":[
      {
        "school":"GPREC",
        "degree":"Bachelors in Electronics and Communications",
        "graduated":"In April 2007",
        "description":""
      }
    ],
    "work":[
      {
        "company":"Innowell Pty Ltd",
        "title": "Senior Fullstack Engineer",
        "years": "Jan 2019 - Present",
        "description": "For most of my time at Innowell, I have worked as a Full Stack Software Engineer. Here I have had the chance to dig in and get my hands dirty with frontend side of our product. I have worked with our Ruby backend, as well as built node-based google cloud functions for the product. I have worked extensively with React/Redux as well as with react hooks. \n\nMore recently, I started working on isolating frontend and backend of the huge monolith we have as a side project :)."
      },
      {
        "company":"Fairfax Media Pty Ltd",
        "title":"Senior Software Engineer",
        "years":"April 2014 - December 2018",
        "description": " Worked on strategic initiatives on technology selection, prototypes development, research, development and process improvement.   \n                             Encouraged test driven development as an integral part of delivering software development across the teams.    \n                             Developed unit and integration tests and perform the validation using contemporary tools. Setup continuous development/continuous integration with Codeship and bitbucket.    \n                             Proactively identify and communicate risks and issues to management and create action plans to mitigate risks    \n                             Redesign the apps based on client and sales teams feedback.    \n                             Coordinate with sales and product teams to increase the revenues of the product    \n                             Coordinate with third party integrations to improve revenue stream.    \n                             Manage team work per sprint and engaging peers in code reviews.    \n                             Be part of a team and product owner to transform our delivery framework to an agile and iterative methodology    \n                             Mentor junior developers and engage in peer technical discussions.    \n                             Technology stack migrations (AngularJS to Angular, Rails 3 to 4, Rails 4 to 5)  "
      },
      {
        "company":"Hewlett Packard Pty Ltd",
        "title":"Technology consultant II",
        "years":"August 2010 - August 2013",
        "description": "In August 2010, I joined Hewlett Packard as a technology consultant for IVR products. I worked for Telefonica O2 UK, MTS India, HP Grenoble Conferencing Solutions, ‘Yes’ Optus  in a span of 3 years which helped me  learn, innovate and adapt to complex environments and customer rich applications. I worked with 'Yes' Optus through Hewlett Packard in Australia, supporting them to enhance their IVR Systems and Front end projects."
      },
       {
         "company": "IBM India Pty Ltd",
         "title": "System engineer (Associate)",
         "years": "April 2008 - August 2010",
         "description": "In May 2007, I got the opportunity to work with IBM India (GBS) as a System Engineer for 3 years  (Provisioning applications for AT&T). During the tenure, I gained experience in the software development life cycle process and also learned the techniques of efficient java/j2ee programming. I handled various modules independently, some of which also interacted with different sets of applications using technologies like web services. Interactions with workflow teams helped me build thinking process towards architecture and functioning of projects."
       }
    ],
    "skills":[
      {
        "name":"Git",
        "description":"I use Git for all of my projects so far. I have used Git for version control in small teams and have toyed around with contributing to Open Source Projects.",
        "image":"git.jpg"
      },
      {
        "name":"Java",
        "description":"Java was my first programming language that I started using in college years ago. It is by far the language I am most familiar with in terms of data-structure and algorithm programming.",
        "image":"java.jpg"
      },
      {
        "name":"React Js",
        "description":"I am fairly new to React and really did not like it at first. It has grown on me though and I will continue to use it going forward. I have built a ReactJS based resume-website template (link below in portfolio) which I used as a starting point for this personal site.",
        "image":"react.jpg"
      },
      {
        "name":"Meteor JS",
        "description":"I enjoy MeteorJS for it's ease of configuration and its ability to get a full stack prototype up and running quickly. I used MeteorJS in a team for a Startup Programming class in UVIC in conjunction with React to build the MVP for Smirkspace (below in portfolio)",
        "image":"meteor.jpg"
      },

      {
        "name":"Node JS",
        "description":"Node JS is my server-side scripting language of choice. The bulk of my experience with it has been in conjunction with MeteorJS-based projects",
        "image":"node.jpg"
      },
      {
        "name":"Bootstrap 4",
        "description":"I use Bootstrap more often than not when designing the layout for my sites. It is the framework I am most familiar with and can therefore design more quickly than with others.",
        "image":"bootstrap.jpg"
      },
      {
        "name":"MongoDB",
        "description":"I have used many different database systems and am better educated and experienced with Relational Databases. However, for many applications, the ease of use of MongoDB better suits my needs and it is much more enjoyable to work with",
        "image":"mongo.jpg"
      },
      {
        "name":"Heroku",
        "description":"I use Heroku as my hosting platform for most of my projects because so far they are all unpaid and their free tier is convenient. I also appreciate its integration with Github for such simple deployment.",
        "image":"heroku.jpg"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Canadian Wanderlust",
        "category":"My Travel Blog for my post-university travels",
        "image":"canadian-wanderlust.jpg",
        "url":"https://www.canadianwanderlust.com"
      },
      {
        "title":"Fury Fighting Gear",
        "category":"(offline now) A fighting gear company I started",
        "image":"fury-fighting-gear.jpg",
        "url":"http://www.timbakerdev.com"
      },
      {
        "title":"Original Thai Food",
        "category":"Website I built for a restaurant I like in Thailand",
        "image":"original-thai-food.jpg",
        "url":"https://original-thai-food.herokuapp.com/index.html"
      },
      {
        "title":"Resume Website",
        "category":"A React based resume website template",
        "image":"resume-website.jpg",
        "url":"https://github.com/tbakerx/react-resume-template"
      },
      {
        "title":"Smirkspace",
        "category":"(MVP Only) A React and Meteor based chat University project.",
        "image":"smirkspace.jpg",
        "url":"http://www.smirkspace.com"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"I have had the opportunity to work with Tim on multiple occasions which has always been a pleasure. He is driven and motivated with a consistently positive attitude. Tim excels at communicating with others and is always willing to work hard until he solves the problem at hand.",
        "user":"Alastair Beaumont - Web Developer at AppColony"
      }
    ]
  }
}
